jonacappelle/nRF52-BLE-IMU/IMU/imu.c
				// New IMU data is available: count how many bytes are available
				bytes_available++;
					
				// Put data in the ringbuffer
				config_data[0] = ENABLE_ACCEL;
				len_in = sizeof(config_data);

				uint32_t buffer_acc_len = sizeof(config_data) + sizeof(event->data.acc.vect);
				uint8_t buffer_acc[buffer_acc_len];

				// Copy data into buffer
				memcpy(buffer_acc, config_data, sizeof(config_data));
				memcpy(&buffer_acc[1], (event->data.acc.vect), sizeof(event->data.acc.vect));

				// Put the data in FIFO buffer: APP_FIFO instead of ringbuff library
            	err_code = app_fifo_write(&imu_fifo, buffer_acc, &buffer_acc_len);
				if (err_code == NRF_ERROR_NO_MEM)
            	{
                	NRF_LOG_INFO("IMU FIFO BUFFER FULL!");
            	}
				if (err_code == NRF_SUCCESS)
				{
					NRF_LOG_INFO("OK");
				}
					
			break;
		}
		case INV_SENSOR_TYPE_GYROSCOPE:
		{
			NRF_LOG_INFO("data event %s (mdps): %d %d %d %d", inv_sensor_str(event->sensor),
					(int)(event->data.gyr.vect[0]*1000),
					(int)(event->data.gyr.vect[1]*1000),
					(int)(event->data.gyr.vect[2]*1000),
					(int)(event->data.gyr.accuracy_flag));
	
				// New IMU data is available: count how many bytes are available
				bytes_available++;
					
				// Put data in the ringbuffer
				config_data[0] = ENABLE_GYRO;
				len_in = sizeof(config_data);

				uint32_t buffer_gyro_len = sizeof(config_data) + sizeof(event->data.gyr.vect);
				uint8_t buffer_gyro[buffer_gyro_len];

				// Copy data into buffer
				memcpy(buffer_gyro, config_data, sizeof(config_data));
				memcpy(&buffer_gyro[1], (event->data.gyr.vect), sizeof(event->data.gyr.vect));

				// Put the data in FIFO buffer: APP_FIFO instead of ringbuff library
            	err_code = app_fifo_write(&imu_fifo, buffer_gyro, &buffer_gyro_len);
				if (err_code == NRF_ERROR_NO_MEM)
            	{
                	NRF_LOG_INFO("IMU FIFO BUFFER FULL!");
            	}
				if (err_code == NRF_SUCCESS)
				{
					NRF_LOG_INFO("OK");
				}

			break;
		}
		case INV_SENSOR_TYPE_MAGNETOMETER:
		{
			NRF_LOG_INFO("data event %s (nT): %d %d %d %d", inv_sensor_str(event->sensor),
					(int)(event->data.mag.vect[0]*1000),
					(int)(event->data.mag.vect[1]*1000),
					(int)(event->data.mag.vect[2]*1000),
					(int)(event->data.mag.accuracy_flag));
					
				// New IMU data is available: count how many bytes are available
				bytes_available++;
					
				// Put data in the ringbuffer
				config_data[0] = ENABLE_MAG;
				len_in = sizeof(config_data);

				uint32_t buffer_mag_len = sizeof(config_data) + sizeof(event->data.mag.vect);
				uint8_t buffer_mag[buffer_mag_len];

				// Copy data into buffer
				memcpy(buffer_mag, config_data, sizeof(config_data));
				memcpy(&buffer_mag[1], (event->data.mag.vect), sizeof(event->data.mag.vect));

				// Put the data in FIFO buffer: APP_FIFO instead of ringbuff library
            	err_code = app_fifo_write(&imu_fifo, buffer_mag, &buffer_mag_len);
				if (err_code == NRF_ERROR_NO_MEM)
            	{
                	NRF_LOG_INFO("IMU FIFO BUFFER FULL!");
            	}
				if (err_code == NRF_SUCCESS)
				{
					NRF_LOG_INFO("OK");
				}
					
			break;
		}
		case INV_SENSOR_TYPE_UNCAL_GYROSCOPE:
		{
			INV_MSG(INV_MSG_LEVEL_INFO, "data event %s (mdps): %d %d %d %d %d %d", inv_sensor_str(event->sensor),
					(int)(event->data.gyr.vect[0]*1000),
					(int)(event->data.gyr.vect[1]*1000),
					(int)(event->data.gyr.vect[2]*1000),
					(int)(event->data.gyr.bias[0]*1000),
					(int)(event->data.gyr.bias[1]*1000),
					(int)(event->data.gyr.bias[2]*1000));
			break;
		}
		case INV_SENSOR_TYPE_UNCAL_MAGNETOMETER:
		{
			INV_MSG(INV_MSG_LEVEL_INFO, "data event %s (nT): %d %d %d %d %d %d", inv_sensor_str(event->sensor),
					(int)(event->data.mag.vect[0]*1000),
					(int)(event->data.mag.vect[1]*1000),
					(int)(event->data.mag.vect[2]*1000),
					(int)(event->data.mag.bias[0]*1000),
					(int)(event->data.mag.bias[1]*1000),
					(int)(event->data.mag.bias[2]*1000));
			break;
		}
		case INV_SENSOR_TYPE_GAME_ROTATION_VECTOR:
		case INV_SENSOR_TYPE_ROTATION_VECTOR:
		case INV_SENSOR_TYPE_GEOMAG_ROTATION_VECTOR:
		{
				// New IMU data is available: count how many bytes are available
				bytes_available++;
//			NRF_LOG_INFO("Bytes: %d", bytes_available);
			
//			NRF_LOG_INFO("%s:	%d %d %d %d", inv_sensor_str(event->sensor),
//					(int)(event->data.quaternion.quat[0]*1000),
//					(int)(event->data.quaternion.quat[1]*1000),
//					(int)(event->data.quaternion.quat[2]*1000),
//					(int)(event->data.quaternion.quat[3]*1000));
//					(int)(event->data.gyr.accuracy_flag),
//					(int)(event->data.acc.accuracy_flag),	
//					(int)(event->data.mag.accuracy_flag), // 0 - 3: not calibrated - fully calibrated
//					(int)(event->data.quaternion.accuracy_flag));
				
				// Put data in the ringbuffer
				config_data[0] = ENABLE_QUAT6;
				len_in = sizeof(config_data);

				uint32_t buffer_len = sizeof(config_data) + sizeof(event->data.quaternion.quat);
				uint8_t buffer[buffer_len];

				// Copy data into buffer
				memcpy(buffer, config_data, sizeof(config_data));
				memcpy(&buffer[1], (event->data.quaternion.quat), sizeof(event->data.quaternion.quat));

				// // err_code = nrf_ringbuf_cpy_put(&m_ringbuf, config_data, &len_in);
				// // len_in = sizeof(event->data.quaternion.quat);	
				// err_code = nrf_ringbuf_cpy_put(&m_ringbuf, buffer, &buffer_len); //(uint8_t *)(event->data.quaternion.quat)
				// APP_ERROR_CHECK(err_code);

				
				// Put the data in FIFO buffer: APP_FIFO instead of ringbuff library
            	err_code = app_fifo_write(&imu_fifo, buffer, &buffer_len);
				if (err_code == NRF_ERROR_NO_MEM)
            	{
                	NRF_LOG_INFO("IMU FIFO BUFFER FULL!");
            	}
				if (err_code == NRF_SUCCESS)
				{
					NRF_LOG_INFO("OK");
				}

				break;
			}
		case INV_SENSOR_TYPE_ORIENTATION:
		{
//			NRF_LOG_INFO("data event %s (e-3):, %d, %d, %d, Accuracy: %d ", inv_sensor_str(event->sensor),
//					(int)(event->data.orientation.x*1000),
//					(int)(event->data.orientation.y*1000),
//					(int)(event->data.orientation.z*1000),
//					(int)(event->data.orientation.accuracy_flag*1000)); // 0 - 3: not calibrated - fully calibrated
		NRF_LOG_INFO("%d, %d, %d, %d, %d, %d", // rewritten write funtion to allow easier plotting
					(int)(event->data.orientation.x),
					(int)(event->data.orientation.y),
					(int)(event->data.orientation.z),
//					(int)(event->data.orientation.accuracy_flag),
					(int)(event->data.gyr.accuracy_flag),
					(int)(event->data.acc.accuracy_flag),	
					(int)(event->data.mag.accuracy_flag)); // 0 - 3: not calibrated - fully calibrated
					
