jonacappelle/nRF52-BLE-IMU/IMU/imu.c
		/* Activity classification */
//		rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_BAC);
//		check_rc(rc);
		
		/* Step Counter */
//		rc += inv_device_ping_sensor(device, INV_SENSOR_TYPE_STEP_COUNTER);
//		check_rc(rc);
//		rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_STEP_COUNTER);
//		check_rc(rc);
		
//		inv_device_set_sensor_timeout(device, INV_SENSOR_TYPE_GAME_ROTATION_VECTOR, 5);
		
			return NRF_SUCCESS;
}


uint32_t imu_init(void)
{

		// Initialize IMU FIFO structure
		uint32_t err_code = app_fifo_init(&imu_fifo, imu_buffer, (uint16_t)sizeof(imu_buffer));


		/*
		 * Setup message facility to see internal traces from IDD
		 */

		INV_MSG_SETUP(MSG_LEVEL, msg_printer);

		INV_MSG(INV_MSG_LEVEL_INFO, "###################################");
		INV_MSG(INV_MSG_LEVEL_INFO, "#          20948 example          #");
		INV_MSG(INV_MSG_LEVEL_INFO, "###################################");
		NRF_LOG_FLUSH();

		/* To keep track of errors */
		int rc = 0;
		
		
		uint8_t whoami;
		
		/* Open serial interface (SPI or I2C) before playing with the device */
		// Not needed anymore - this is implemented in the inv_host_serif_open(&my_serif_instance)
//		twi_init();
		
		rc = inv_host_serif_open(&my_serif_instance);
		check_rc(rc);
		
		NRF_LOG_INFO("i2c init");
		NRF_LOG_FLUSH();
		
		NRF_LOG_INFO("icm20948 init");
		NRF_LOG_FLUSH();
		/*
		 * Create ICM20948 Device 
		 * Pass to the driver:
		 * - reference to serial interface object,
		 * - reference to listener that will catch sensor events,
		 */
		inv_device_icm20948_init(&device_icm20948, &my_serif_instance, &sensor_listener, dmp3_image, sizeof(dmp3_image));
//		inv_device_icm20948_init2(&device_icm20948, &my_serif_instance, &sensor_listener, dmp3_image, sizeof(dmp3_image));
		NRF_LOG_FLUSH();
		
		NRF_LOG_INFO("icm20948 get base");
		NRF_LOG_FLUSH();
		/*
		 * Simply get generic device handle from Icm20948 Device
		 */
		device = inv_device_icm20948_get_base(&device_icm20948);
		NRF_LOG_FLUSH();
		
		/* Just get the whoami */
		rc += inv_device_whoami(device, &whoami);
		check_rc(rc);
		NRF_LOG_INFO("Data: 0x%x", whoami);
		NRF_LOG_FLUSH();
		
		nrf_delay_ms(500);
		
		/* Configure and initialize the Icm20948 device */
		NRF_LOG_INFO("Setting up ICM20948");
		NRF_LOG_FLUSH();
		rc += inv_device_setup(device);
		check_rc(rc);
		
		// Load DMP
		NRF_LOG_INFO("Load DMP Image");
		NRF_LOG_FLUSH();
		rc += inv_device_load(device, NULL, dmp3_image, sizeof(dmp3_image), true /* verify */, NULL);
		check_rc(rc);

		imu_enable_sensors(imu);



		return NRF_SUCCESS;
}

uint32_t imu_get_bytes_available(void)
{
	return bytes_available;
}

void imu_set_bytes_available(uint32_t bytes)
{
	bytes_available = bytes;
}

size_t get_imu_packet_length(IMU imu)
{
	return imu.packet_length;
}

uint32_t IMU_buffer_bytes_available()
{
	uint32_t err_code;
	uint32_t data_len;
	// Request number of elements in the FIFO
	err_code = app_fifo_read(&imu_fifo, NULL, &data_len);
	// Check if request was successful
	if (err_code == NRF_SUCCESS)
	{
		// data_len contains the number of elements that can be read
		return 1;
	}
	else if (err_code == NRF_ERROR_NOT_FOUND)
	{
		// FIFO is empty
		return 0;
	}
	else
	{
		// API parameters incorrect, should not happen
		NRF_LOG_INFO("Error in IMU_buffer_bytes_available()");
	}
}


void IMU_data_get(uint8_t * data, uint16_t * len)
{
		uint32_t err_code;

		*len = imu.packet_length;
	
		NRF_LOG_INFO("len_out: %d   %d", *len, packet_length_temp);
	
		uint8_t temp[*len];
		// err_code = nrf_ringbuf_cpy_get(&m_ringbuf, temp, (size_t *) len);
		// APP_ERROR_CHECK(err_code);

		if( (err_code = app_fifo_read(&imu_fifo, temp, len)) == NRF_SUCCESS )
		{
			memcpy(data, temp, *len);
			NRF_LOG_INFO("OKK");
		}
		if( err_code = NRF_ERROR_NOT_FOUND )
		{
			NRF_LOG_INFO("IMU FIFO EMPTY");
		}
	
	NRF_LOG_INFO("temp: %X %X %X %X", temp[0], temp[1], temp[2], temp[3]);
//		NRF_LOG_INFO("%d %d %d %d", (int)(quat[0]*1000),(int)(quat[1]*1000),(int)(quat[2]*1000),(int)(quat[3]*1000));
//		NRF_LOG_INFO("%d %d %d", (int)(temp[0]*1000),(int)(temp[1]*1000),(int)(temp[2]*1000));
		// memcpy(data, temp, *len);
}

void usr_ringbuf_init(void)
{
	nrf_ringbuf_init(&m_ringbuf);
}

